{
    "vocab_size": 51200,
    "n_ctx": 1024,
    "n_positions": 1024,
    "n_embd": 768,
    "n_layer": 12,
    "n_head": 12,
    "n_inner": null,
    "activation_function": "gelu_new",
    "resid_pdrop": 0.1,
    "embd_pdrop": 0.1,
    "attn_pdrop": 0.1,
    "layer_norm_epsilon": 1e-05,
    "initializer_range": 0.02,
    "summary_type": "cls_index",
    "summary_use_proj": true,
    "summary_activation": null,
    "summary_first_dropout": 0.1,
    "summary_proj_to_labels": true,
    "scale_attn_weights": true,
    "use_cache": true,
    "bos_token_id": 0,
    "eos_token_id": 1,
    "return_dict": true,
    "output_hidden_states": false,
    "output_attentions": false,
    "torchscript": false,
    "torch_dtype": null,
    "use_bfloat16": false,
    "pruned_heads": {},
    "tie_word_embeddings": true,
    "is_encoder_decoder": false,
    "is_decoder": false,
    "add_cross_attention": false,
    "tie_encoder_decoder": false,
    "max_length": 20,
    "min_length": 0,
    "do_sample": false,
    "early_stopping": false,
    "num_beams": 1,
    "num_beam_groups": 1,
    "diversity_penalty": 0.0,
    "temperature": 1.0,
    "top_k": 50,
    "top_p": 1.0,
    "repetition_penalty": 1.0,
    "length_penalty": 1.0,
    "no_repeat_ngram_size": 0,
    "encoder_no_repeat_ngram_size": 0,
    "bad_words_ids": null,
    "num_return_sequences": 1,
    "chunk_size_feed_forward": 0,
    "output_scores": false,
    "return_dict_in_generate": false,
    "forced_bos_token_id": null,
    "forced_eos_token_id": null,
    "remove_invalid_values": false,
    "architectures": [
        "GPT2LMHeadModel"
    ],
    "finetuning_task": null,
    "id2label": {
        "0": "LABEL_0"
    },
    "label2id": {
        "LABEL_0": 0
    },
    "tokenizer_class": null,
    "prefix": null,
    "pad_token_id": 3,
    "sep_token_id": null,
    "decoder_start_token_id": null,
    "task_specific_params": {
        "text-generation": {
            "do_sample": true,
            "max_length": 50
        }
    },
    "problem_type": null,
    "_name_or_path": "skt/kogpt2-base-v2",
    "transformers_version": "4.11.3",
    "_num_labels": 1,
    "gradient_checkpointing": false,
    "model_type": "gpt2",
    "author": "Heewon Jeon(madjakarta@gmail.com)",
    "created_date": "2021-04-28",
    "license": "CC-BY-NC-SA 4.0"
}